from django.shortcuts import render

code_dic = {
    '18': {'f': '机构概况', 's': '机构简介'},
    '26': {'f': '机构概况', 's': '组织机构'},
    '27': {'f': '机构概况', 's': '主要领导'},
    '44': {'f': '机构概况', 's': '发展记录'},
    '9': {'f': '通知公告', 's': '重要通知'},
    '74': {'f': '通知公告', 's': '人事安排'},
    '75': {'f': '通知公告', 's': '工作动态'},
    '16': {'f': '课题研究', 's': '课题立项'},
    '30': {'f': '课题研究', 's': '课题公示'},
    '51': {'f': '课题研究', 's': '课题结项'},
    '52': {'f': '课题研究', 's': '学术成果'},
    '01': {'f': '学术资讯', 's': '专家观点'},
    '02': {'f': '学术资讯', 's': '知识科普'},
    '03': {'f': '学术资讯', 's': '学者论述'},
    '04': {'f': '学术资讯', 's': '学术研究'},
    '34': {'f': '教育培训', 's': '基地查询'},
    '82': {'f': '教育培训', 's': '基地风采'},
    '57': {'f': '合作交流', 's': '合作项目'},
    '83': {'f': '合作交流', 's': '成果展示'},
    '20': {'f': '风土文化', 's': '自然景观'},
    '31': {'f': '风土文化', 's': '好物推荐'},
    '001': {'f': '风土文化', 's': '风土人情'},
    '002': {'f': '风土文化', 's': '文学欣赏'},
    '003': {'f': '风土文化', 's': '体育文化'},
    '004': {'f': '风土文化', 's': '健康知识'},
    '77': {'f': '证书查询', 's': '专业人才技能证书'},
    '78': {'f': '证书查询', 's': '特聘研究员'},
    '79': {'f': '证书查询', 's': '荣誉证书'},
    '80': {'f': '证书查询', 's': '行业专家'},
    '81': {'f': '证书查询', 's': '学术顾问'},
    '60': {'f': '联系我们'},

}


# Create your views here.
def change_data(info):
    return code_dic.get(info).get("f"), code_dic.get(info).get('s')


# 首页
def index(request):
    return render(request, 'pc/index.html')


# 跳转页
def jump(request, info):
    first_name, second_name = change_data(info)
    return render(request, 'pc/info.html', {'first_name': first_name, 'second_name': second_name})
